aaron-bond.better-comments
alefragnani.bookmarks
antfu.browse-lite
anthropic.claude-code
batisteo.vscode-django
bierner.github-markdown-preview
bierner.markdown-checkbox
bierner.markdown-emoji
bierner.markdown-footnotes
bierner.markdown-mermaid
bierner.markdown-preview-github-styles
bierner.markdown-yaml-preamble
bradlc.vscode-tailwindcss
chakrounanas.turbo-console-log
charliermarsh.ruff
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
cirlorm.mobileview
cweijan.dbclient-jdbc
cweijan.vscode-postgresql-client2
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
deque-systems.vscode-axe-linter
donjayamanne.python-environment-manager
donjayamanne.python-extension-pack
dsznajder.es7-react-js-snippets
eamodio.gitlens
esbenp.prettier-vscode
fabiospampinato.vscode-terminals
figma.figma-vscode-extension
firefox-devtools.vscode-firefox-debug
firsttris.vscode-jest-runner
formulahendry.auto-rename-tag
formulahendry.code-runner
github.copilot
github.copilot-chat
github.vscode-pull-request-github
gocodeo.gocodeo
gruntfuggly.todo-tree
humao.rest-client
jock.svg
johnpapa.vscode-peacock
kevinrose.vsc-python-indent
mattpocock.ts-error-translator
meganrogge.template-string-converter
mhutchie.git-graph
ms-azure-load-testing.microsoft-testing
ms-azuretools.azure-dev
ms-azuretools.vscode-azure-github-copilot
ms-azuretools.vscode-azure-mcp-server
ms-azuretools.vscode-azureappservice
ms-azuretools.vscode-azurecontainerapps
ms-azuretools.vscode-azurefunctions
ms-azuretools.vscode-azureresourcegroups
ms-azuretools.vscode-azurestaticwebapps
ms-azuretools.vscode-azurestorage
ms-azuretools.vscode-azurevirtualmachines
ms-azuretools.vscode-containers
ms-azuretools.vscode-cosmosdb
ms-azuretools.vscode-docker
ms-edgedevtools.vscode-edge-devtools
ms-playwright.playwright
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode-remote.remote-ssh
ms-vscode-remote.remote-ssh-edit
ms-vscode-remote.remote-wsl
ms-vscode-remote.vscode-remote-extensionpack
ms-vscode.live-server
ms-vscode.powershell
ms-vscode.remote-explorer
ms-vscode.remote-server
ms-vscode.vscode-node-azure-pack
ms-windows-ai-studio.windows-ai-studio
naumovs.color-highlight
njpwerner.autodocstring
oderwat.indent-rainbow
orta.vscode-jest
parthmanhas.responsive-viewer
pkief.material-icon-theme
pranaygp.vscode-css-peek
rangav.vscode-thunder-client
ryu1kn.partial-diff
simonsiefke.svg-preview
sndst00m.vscode-native-svg-preview
spmeesseman.vscode-taskexplorer
steoates.autoimport
streetsidesoftware.code-spell-checker
styled-components.vscode-styled-components
teamsdevapp.vscode-ai-foundry
tombonnike.vscode-status-bar-format-toggle
tyriar.sort-lines
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vitaliymaz.vscode-svg-previewer
vscode-snippet.snippet
wallabyjs.console-ninja
wallabyjs.quokka-vscode
wayou.vscode-todo-highlight
wholroyd.jinja
wix.vscode-import-cost
yoavbls.pretty-ts-errors
yzhang.markdown-all-in-one
zhuangtongfa.material-theme
